skuep/AIOC/stm32/aioc-fw/Src/usb_audio.c
    /* Buffer as destination */
    DMA2_Channel1->CMAR = (uint32_t)ADC_samples;

    /* Enable DMA */
    DMA2_Channel1->CCR |= DMA_CCR_EN;

    /* Left align, Continuous mode, DMA Circular Mode, DMA Enabled */
    ADC2->CFGR = ADC_CFGR_CONT | ADC_CFGR_DMACFG | ADC_CFGR_DMAEN;

    /* Maximum sample time of 2.5 cycles for channel 12 */
    ADC2->SMPR2 = 0x1 << ADC_SMPR2_SMP12_Pos;

    /* Sample only channel 12 in a regular sequence */
    ADC2->SQR1 = (12 << ADC_SQR1_SQ1_Pos) | (0 << ADC_SQR1_L_Pos);

    /* Start ADC */
    ADC2->CR |= ADC_CR_ADSTART;

    NVIC_SetPriority(DMA2_Channel1_IRQn, AIOC_IRQ_PRIO_AUDIO);
}

static void DAC_Init(void)
{
    __HAL_RCC_DAC1_CLK_ENABLE();

    /* Select TIM6 TRGO as trigger and enable DAC */
    DAC->CR = (0x0 << DAC_CR_TSEL1_Pos) | DAC_CR_TEN1 | DAC_CR_EN1;
}

static void Timeout_Timers_Init()
{
    uint32_t timerFreq = (HAL_RCC_GetHCLKFreq() == HAL_RCC_GetPCLK2Freq()) ? HAL_RCC_GetPCLK2Freq() : 2 * HAL_RCC_GetPCLK2Freq();
    uint32_t pttTimeout = (settingsRegMap[SETTINGS_REG_VPTT_TIMCTRL] & SETTINGS_REG_VPTT_TIMCTRL_TIMEOUT_MASK) >> SETTINGS_REG_VPTT_TIMCTRL_TIMEOUT_OFFS;
    uint32_t cosTimeout = (settingsRegMap[SETTINGS_REG_VCOS_TIMCTRL] & SETTINGS_REG_VCOS_TIMCTRL_TIMEOUT_MASK) >> SETTINGS_REG_VCOS_TIMCTRL_TIMEOUT_OFFS;

    __HAL_RCC_TIM16_CLK_ENABLE();
    __HAL_RCC_TIM17_CLK_ENABLE();

   /* TIM16 and TIM17 are timeout-counters for PTT and COS */
   TIM16->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP;
   TIM16->PSC = timerFreq / 16000 - 1; /* 16 kHz counter */
   TIM16->CCR1 = pttTimeout - 1;
   TIM16->DIER = TIM_DIER_UIE | TIM_DIER_CC1IE;

   TIM17->CR1 = TIM_CLOCKDIVISION_DIV1 | TIM_COUNTERMODE_UP;
   TIM17->PSC = timerFreq / 16000 - 1; /* 16 kHz counter */
   TIM17->CCR1 = cosTimeout - 1;
   TIM17->DIER = TIM_DIER_UIE | TIM_DIER_CC1IE;

   NVIC_SetPriority(TIM16_IRQn, AIOC_IRQ_PRIO_AUDIO);
   NVIC_EnableIRQ(TIM16_IRQn);

   NVIC_SetPriority(TIM17_IRQn, AIOC_IRQ_PRIO_AUDIO);
   NVIC_EnableIRQ(TIM17_IRQn);
}

void USB_AudioInit(void)
{
    GPIO_Init();
    Timer_DAC_Init();
    rational_decimator_init(&adc_resampler);
    rational_decimator_set_rate(&adc_resampler, ADC_get_sample_rate(), DEFAULT_SAMPLE_RATE);
    ADC_Init();
    DAC_Init();

    Timeout_Timers_Init();
}

void USB_AudioGetSpeakerFeedbackStats(usb_audio_fbstats_t * status)
{
    *status = (usb_audio_fbstats_t) {
        .feedbackMin = speakerFeedbackMin,
        .feedbackMax = speakerFeedbackMax,
        .feedbackAvg = (uint32_t) (speakerFeedbackAvg >> 16)
    };
}

void USB_AudioGetSpeakerBufferStats(usb_audio_bufstats_t * status)
{
    *status = (usb_audio_bufstats_t) {
        .bufLevelMin = speakerBufferLvlMin,
        .bufLevelMax =  speakerBufferLvlMax,
        .bufLevelAvg = (uint16_t) (speakerBufferLvlAvg >> 16)
    };

}
